export default function isDate() {
  const userString = prompt("Введите строку для проверки:");
  const regexpSource = [
    /^(3[01]|[12][0-9]|0?[1-9])(\/|-|\.)(0?[1-9]|1[012])\2(\d{2})?\d{2}$/,
    /^(1[0-2]|0?[1-9])(\/|-|\.)(3[01]|[12][0-9]|0?[1-9])\2(\d{2})?\d{2}$/,
    /^(\d{2})?\d{2}(\/|-|\.)(1[0-2]|0?[1-9])\2(3[01]|[12][0-9]|0?[1-9])$/,
    /^(\d{2})?\d{2}(\/|-|\.)(3[01]|[12][0-9]|0?[1-9])\2(1[0-2]|0?[1-9])$/,
  ];

  return regexpSource.reduce(
    (result, value) => result || value.test(userString),
    false,
  );
}
